import './map.scss'

// const mapElement = document.querySelector("#map")
// console.log(mapElement)
// if (mapElement) {



//     // Функция ymaps.ready() будет вызвана, когда
//     // загрузятся все компоненты API, а также когда будет готово DOM-дерево.
//     ymaps.ready(init);
//     function init(){
//         // Создание карты.
//         var myMap = new ymaps.Map("map", {
//             // Координаты центра карты.
//             // Порядок по умолчанию: «широта, долгота».
//             // Чтобы не определять координаты центра карты вручную,
//             // воспользуйтесь инструментом Определение координат.
//             center: [59.955486, 30.337817],
//             // Уровень масштабирования. Допустимые значения:
//             // от 0 (весь мир) до 19.
//             zoom: 12,
//             autoReverseGeocode: false
//         });
//     }
// }
